app/Models/M_Barang.php

    public function getAllData()
    {
        return $this->db->table('mlaporankerusakan')->get()->getResultArray();
---
SELECT *
FROM `mlaporankerusakan`

    public function getBarang($ID)
    {
        if ($ID == false) {
            return $this->db->table('mlaporankerusakan')->get()->getResultArray();
        }

        return $this->db->table('mlaporankerusakan')->getWhere(['ID' => $ID])->getFirstRow();
---
SELECT *
FROM `mlaporankerusakan`
WHERE `ID` = '2'